---
kind: other
id: Properties.T:Autodesk.Revit.DB.KeynoteEntry
source: html/5ee8cc7f-f4ef-561a-695a-6c67e6d1d24b.htm
---
# KeynoteEntry Properties

Specifies whether the .NET object represents a valid Revit entity.